# CutProfileHoles

## Description
Cut holes in object geometry described in it's profile group.

```pascal
PROCEDURE CutProfileHoles(hWall : HANDLE);
```

```python

def vs.CutProfileHoles(hWall):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hWall|HANDLE||

## Version
Availability: from Vectorworks 2014
## Category
* Graphic Calculation